{
    "basics": {
        "name": "Andrei Matea",
        "label": "Software Engineer",
        "picture": "profile.jpg",
        "email": "andrei.matea96@gmail.com",
        "phone": "(+40) 764.147.485",
        "website": "",
        "summary": "Dedicated and enthusiastic iOS Developer with several years experience in delivering apps from scratch to AppStore release. Worked with many Start-Up project ideas, but also with leading video / e-commerce industires and IoT clients.",
        "location": {
            "city": "Remote",
            "region": "Cluj-Napoca",
            "countryCode": "RO"
        },
        "profiles": [
            {
                "network": "GitHub",
                "username": "Shliferd",
                "url": "https://github.com/Shliferd"
            },
            {
                "network": "LinkedIn",
                "username": "andrei-matea",
                "url": "https://www.linkedin.com/in/andrei-matea"
            }
        ]
    },
    "work": [
        {
            "company": "GrubHub",
            "position": "iOS Software Engineer",
            "website": "https://about.grubhub.com/",
            "startDate": "2022-08-01",
            "summary": "This role continues my work from Blue Wire Software, now directly within the client's team. Initially, I contributed to the Group Orders feature, which required integration with multiple app modules that were not originally designed to support group ordering. This posed significant challenges related to transparency, scalability, and cross-team communication, all of which were crucial to successfully implementing the feature. Once Group Orders was completed, I transitioned to a new team focused on pre-checkout user experience, where I now independently manage a part of the pre-checkout flow. My work involves refining the user journey before order placement, optimizing performance, and ensuring a seamless and intuitive experience.",
            "highlights": [
                "E-commerce: Food delivery application.",
                "Pre-checkout flow: Leading improvements to enhance usability and streamline order finalization.",
                "Group Orders: Integrated group ordering across the app, ensuring modular compatibility."
            ]
        },
        {
            "company": "Blue Wire Software",
            "position": "iOS Software Engineer",
            "website": "https://bws.rocks",
            "startDate": "2021-09-01",
            "endDate": "2022-07-31",
            "summary": "During this collaboration, I worked on a long-term food delivery project, embedded within the client’s team. Each team was responsible for a specific sub-project within the main app, requiring strong dependency management and careful coordination across multiple teams. The project involved maintaining and improving legacy code, implementing new features, and ensuring the app remained scalable and maintainable as new functionalities were introduced. The project involved maintaining and improving legacy code, implementing new features, and ensuring the app remained scalable and maintainable as new functionalities were introduced.",
            "highlights": [
                "E-commerce: Outsourced to work directly within the client’s team.",
                "Food delivery project: Tackling complex legacy code while contributing to new feature development."
            ]
        },
        {
            "company": "Halcyon Mobile",
            "position": "iOS Software Engineer",
            "website": "https://halcyonmobile.com",
            "startDate": "2018-07-01",
            "endDate": "2021-08-31",
            "summary": "I embarked on a journey that significantly enhanced my technical expertise and professional growth. Collaborating with a dynamic team, I contributed to a diverse array of projects across multiple industries, including e-commerce, Bluetooth Low Energy (BLE) applications, video streaming, mental health, and user movement tracking. Throughout my tenure at Halcyon Mobile, I embraced a culture of continuous learning and adaptability, contributing to the company's growth while honing my skills across various domains.",
            "highlights": [
                "E-commerce: Contributed to two outsourced projects—an online car parts shop and an airline company's app—focusing on updating existing applications with new features. Utilized internal frameworks to maintain consistency across projects and implemented a CMS-driven architecture, enabling clients to make real-time changes without deploying new builds.", 
                "Bluetooth Low Energy: Developed an application to control lighting devices via BLE, encompassing functionalities like device pairing, grouping, and applying various animations with adjustable colors, intensities, and frequencies. Emphasized offline storage and reactive programming to ensure seamless operation during interruptions.", 
                "Video industry: Worked on two outsourcing projects centered around video and live streaming. Implemented UICollectionViewCompositionalLayout for managing multiple scrollable collections with diverse content types. Handled video players, overlays, picture-in-picture mode, advertisements, and analytics integration.", 
                "Mental health: Contributed to a successful startup focused on journaling, habit and mood tracking, and meditation. Gained experience in implementing various charts, animations, transitions, audio players, and managing cloud/in-app messaging.", 
                "User tracking movement: Developed an application for marathon events, allowing users to purchase tickets and watch participants live or offline. Focused on tracking participants on a map with event-specific layers, utilizing MapBox, MapKit, and Google Maps.", 
                "Local and internal projects: Initially focused on UI components and flow navigation, building foundational skills in UI design, networking, and application architecture."
            ]
        },
        {
            "company": "Halcyon Mobile",
            "position": "iOS Mentor",
            "website": "https://halcyonmobile.com",
            "startDate": "2020-06-12",
            "endDate": "2020-08-17",
            "summary": "During the iOS internship, each intern was paired with a mentor who provided guidance and support throughout the program. Mentors primarily assisted with technical insights, best practices for Swift and iOS development, code optimization tips, pull request reviews, and progress tracking. They also helped interns navigate challenges related to UIKit, debugging, performance improvements, and adhering to Apple's Human Interface Guidelines.",
            "highlights": ["Constant feedback about the progress of an iOS junior", "Code reviews", "Team management within internship project"]
        }
    ],
    "volunteer": [
        {
            "organization": "Societatea Hermes",
            "position": "Events volunteer",
            "website": "https://www.societatea-hermes.ro",
            "startDate": "2015-11-01",
            "endDate": "2018-01-01",
            "summary": "As part of my volunteer efforts with Societatea Hermes — the student organization of the Faculty of Mathematics and Computer Science at Babeș-Bolyai University — we organized various social and networking events tailored for UBB students, particularly those from the Faculty of Mathematics and Informatics. These initiatives aimed to foster community engagement and enhance the student experience.",
            "highlights": ["Destresiune", "SSMI", "Balul Bobocilor"]
        }
    ],
    "education": [
        {
            "institution": "Babes-Bolyai University",
            "area": "Computer Science",
            "studyType": "Bachelor degree",
            "startDate": "2015-10-01",
            "endDate": "2018-07-08",
            "gpa": "",
            "courses": []
        }
    ],
    "awards": [
        {
            "title": "Most active volunteer",
            "date": "2016-11-01",
            "awarder": "Societatea Hermes",
            "summary": "As a sign of gratitude for the dedication, passion and perseverance shown during the event Freshman Ball."
        }
    ],
    "skills": [
        {
            "name": "General",
            "keywords":[
                "UIKit",
                "UI Compositional Layout",
                "PieCharts",
                "AV Player",
                "AV Sound Player",
                "SwiftLint",
                "SwiftGen",
                "MVC",
                "MVVM"
            ]
        },
        {
            "name": "Dependency managers",
            "keywords": [
                "Swift Package Manager",
                "Cocoapods*",
                "Bundler",
                "Homebrew"
            ]
        },
        {
            "name": "Networking",
            "keywords": [
                "Alamofire",
                "RestBird",
                "PromiseKit",
                "OAuth 2",
                "Facebook SDK",
                "GoogleSignIn"
            ]
        },
        {
            "name": "Reactive programming",
            "keywords": [
                "RxSwift",
                "RxCocoa"
            ]
        },
        {
            "name": "Databases",
            "keywords": [
                "Realm",
                "Firebase",
                "GRDB",
                "MySQL",
                "SQLite",
                "Gigya"
            ]
        },
        {
            "name": "Notifications",
            "keywords": [
                "Braze",
                "Firebase Cloud Messaging",
                "Firebase In-App Messaging"
            ]
        },
        {
            "name": "Bluetooth Low Energy",
            "keywords": [
                "Core Bluetooth"
            ]
        },
        {
            "name": "Maps",
            "keywords": [
                "MapBox",
                "MapKit",
                "Google Maps"
            ]
        },
        {
            "name": "Ads and analytics",
            "keywords": [
                "GoogleAds",
                "Google Analytics",
                "Segment",
                "Clickstream",
                "New Relic",
                "DataDog"
            ]
        },
        {
            "name": "CI/CD",
            "keywords": [
                "Fastlane",
                "Jenkins",
                "GitHub Actions / Workflows"
            ]
        }
    ],
    "languages": [
        {
            "language": "Romanian",
            "fluency": "Native speaker"
        },
        {
            "language": "English",
            "fluency": "Elementary proficiency"
        }
    ],
    "interests": [
        {
            "name": "Software Engineering",
            "keywords": []
        },
        {
            "name": "Team leading",
            "keywords": []
        },
        {
            "name": "Project Management",
            "keywords": []
        }
    ],
    "references": [
        {
            "name": "",
            "reference": ""
        }
    ]
}
