{
    "basics": {
        "name": "Andrei Matea",
        "label": "Software Engineer",
        "picture": "profile.jpg",
        "email": "andrei.matea96@gmail.com",
        "phone": "(+40) 764.147.485",
        "website": "",
        "summary": "Dedicated and enthusiastic iOS Developer with several years experience in delivering apps from scratch to AppStore release. Worked with many Start-Up project ideas, but also with leading video and e-commerce industires and IoT clients.",
        "location": {
            "city": "Remote",
            "region": "Cluj-Napoca",
            "countryCode": "RO"
        },
        "profiles": [
            {
                "network": "GitHub",
                "username": "Shliferd",
                "url": "https://github.com/Shliferd"
            },
            {
                "network": "LinkedIn",
                "username": "andrei-matea",
                "url": "https://www.linkedin.com/in/andrei-matea"
            }
        ]
    },
    "work": [
        {
            "company": "Blue Wire Software",
            "position": "iOS Software Engineer",
            "website": "https://bws.rocks",
            "startDate": "2018-09-01",
            "summary": "This collaboration resumes mostly working on a single project, long term. Each team has their own sub-project within the main app; good dependency handling being the most important aspect.",
            "highlights": ["E-commerce - Outsourced within client's team. Food delivery project with lots of legacy code."]
        },
        {
            "company": "Halcyon Mobile",
            "position": "iOS Software Engineer",
            "website": "https://halcyonmobile.com",
            "startDate": "2018-07-01",
            "endData:" "2021-08-31",
            "summary": "As the starting point of my journey, Halcyon cultivated my knowledge and sharpened my skills with each project I had the chance to work on. As I've started from scratch and ground my professional skills, I've had the chance to grow with the company itself during a period of almost 3 years and to work on a variety of project ideas and utilities, as you can see below:",
            "highlights": ["E-commerce - Worked on 2 projects here, an online shop for car parts and the other an airline company. For each of them I was working outsourced, mainly for updates on the already existing apps, such as new features or additions. On a daily basics I would work with mostly internal frameworks used across multiple projects, abstraction being a key element; the apps were CMS driven, the client could this way to make a change without the need of shipping a new build.", "Bluetooth Low Energy - The client had multiple lighting devices that aimed to be controlled via a mobile application. The app itself was supposed to do the job of a whole console, such as pairing, grouping, applying a variety of animations with different colours, intensities and frequencies, exporting/importing configurations from one device to another and so on. The offline storage and reactive programming were heavily used since all the data needed to be stored and interruptions with on hold/resume states could occur for different reasons.", "Video industry - Here's about 2 other outsourcing projects, basically focused on video and live streaming. Used the UICompositionalLayout for multiple scroll collections with different types of content cells. Content was section driven on the back-end response, applying a type depending on the response we've got back. Worked with video players, overlayers, picture in picture, advertisements and analytics.", "Mental health - It was a start-up idea, but the app was a blast, having a great success; it was focused on journaling, bullet journey, habit and mood tracking, meditation, etc. I've gathered knowledge about using different types of charts, animations and transitions, audio players and cloud/in-app messages.", "User tracking movement - The app was supposed to be used during marathons or races. You could buy tickets to different tournaments within the app either for participating or watching live/offline the other participants. The version I worked on focussed on the latter one; the user could observe on a map multiple participants, the track with different layers depending on the event and highlight various aspects to focus during the watch time. Used MapBox mostly, but also MapKit and Google Maps.", "Local and internal projects - These were the first projects I've been working on. I've been manily focused on UI components and flow navigations. Had the chance to work on the basics, as UI, networking and architecture."]
        },
        {
            "company": "Halcyon Mobile",
            "position": "iOS Mentor",
            "website": "https://halcyonmobile.com",
            "startDate": "2020-06-12",
            "endDate": "2020-08-17",
            "summary": "During the internship each intern had one or two mentors who guided/helped him throughout the process, mostly with technical information/tips and tricks; pull request reviews and monitoring his/her progress",
            "highlights": ["Constant feedback about the progress of an iOS junior", "Code reviews", "Team management within internship project"]
        }
    ],
    "volunteer": [
        {
            "organization": "Societatea Hermes",
            "position": "Events volunteer",
            "website": "https://www.societatea-hermes.ro",
            "startDate": "2015-11-01",
            "endDate": "2018-01-01",
            "summary": "We've organized different types of social and gathering events dedicated to UBB students, especially for Faculty of Mathematics and Informatics.",
            "highlights": ["Destresiune", "SSMI", "Balul Bobocilor"]
        }
    ],
    "education": [
        {
            "institution": "Babes-Bolyai University",
            "area": "Computer Science",
            "studyType": "Bachelor degree",
            "startDate": "2015-10-01",
            "endDate": "2018-07-08",
            "gpa": "",
            "courses": []
        }
    ],
    "awards": [
        {
            "title": "Most active volunteer",
            "date": "2016-11-01",
            "awarder": "Societatea Hermes",
            "summary": "As a sign of gratitude for the dedication, passion and perseverance shown during the event Freshman Ball"
        }
    ],
    "skills": [
        {
            "name": "General",
            "keywords":[
                "UIKit",
                "UI Compositional Layout",
                "PieCharts",
                "AV Player",
                "AV Sound Player",
                "SwiftLint",
                "SwiftGen"
            ]
        },
        {
            "name": "Dependency managers",
            "keywords": [
                "Cocoapods",
                "Swift Package Manager",
                "Bundler"
            ]
        },
        {
            "name": "Networking",
            "keywords": [
                "Alamofire",
                "RestBird",
                "PromiseKit",
                "OAuth 2",
                "Facebook SDK",
                "GoogleSignIn"
            ]
        },
        {
            "name": "Reactive programming",
            "keywords": [
                "RxSwift",
                "RxCocoa"
            ]
        },
        {
            "name": "Databases",
            "keywords": [
                "Realm",
                "Firebase",
                "GRDB",
                "MySQL",
                "Gigya"
            ]
        },
        {
            "name": "Notifications",
            "keywords": [
                "Firebase Cloud Messaging",
                "Firebase In-App Messaging"
            ]
        },
        {
            "name": "Bluetooth Low Energy",
            "keywords": [
                "Core Bluetooth"
            ]
        },
        {
            "name": "Maps",
            "keywords": [
                "MapBox",
                "MapKit",
                "Google Maps"
            ]
        },
        {
            "name": "Ads and analytics",
            "keywords": [
                "GoogleAds",
                "Google Analytics",
                "Segment"
            ]
        },
        {
            "name": "CI/CD",
            "keywords": [
                "Fastlane",
                "Jenkins"
            ]
        }
    ],
    "languages": [
        {
            "language": "Romanian",
            "fluency": "Native speaker"
        },
        {
            "language": "English",
            "fluency": "Elementary proficiency"
        }
    ],
    "interests": [
        {
            "name": "Software Engineering",
            "keywords": []
        },
        {
            "name": "Team leading",
            "keywords": []
        },
        {
            "name": "Project Management",
            "keywords": []
        }
    ],
    "references": [
        {
            "name": "",
            "reference": ""
        }
    ]
}
